"use strict";
/* --- alert, confirm, prompt --- */

// let message = "Hello world"; // Создать переменную и присвоить ей значение
// alert(message); // Вывести значение переменной в виде сообщения

// let question = confirm("Are you ready?"); // Вывести на страницу сообщение в виде вопроса, на который пользователь может ответить да/нет
// console.log(question); // Вывести в консоль ответ пользователя

// let questionWithAnswer = prompt("Which movies do you like?", "");  // Вывести на страницу вопрос в виде сообщения и с полем для ответа, в котором пользователь  может ответить что угодно
// console.log(questionWithAnswer); // Вывести в консоли ответ пользователя P.S: ответ будет в строчном типе, даже если пользователь ввёл число